Revit 2027 API
WaveDistributionType Enumeration
 The enumerated type representing the permitted values for the asset property "WaveDistribution" from the "Wave" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum WaveDistributionType
Public Enumeration WaveDistributionType
public enum class WaveDistributionType
type WaveDistributionType
Members
Member name | Value | Description
ThreeD | 1
TwoD | 0
See Also
Reference
Autodesk.Revit.DB.Visual Namespace